#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=6313888319879481965]
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=5297501176690203859]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/2004]
proxmox_lxc.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/lxc/2003]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/2005]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-capella/qemu/10000]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-capella/qemu/11000]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "6313888319879481965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-01-05T14:03:38Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "5297501176690203859" -> (known after apply)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-1" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-capella/lxc/2003"
      ~ memory               = 512 -> 256
        tags                 = null
      ~ unprivileged         = true -> false
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-2 will be created
  + resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      + arch         = "amd64"
      + clone        = "9101"
      + cmode        = "tty"
      + console      = true
      + cores        = 1
      + cpulimit     = 0
      + cpuunits     = 1024
      + description  = "cloudflare tunnel for Solufit"
      + hostname     = "solufit-cloudflare-tunnel-2"
      + id           = (known after apply)
      + memory       = 256
      + onboot       = true
      + ostype       = (known after apply)
      + pool         = "solufit"
      + protection   = false
      + start        = true
      + swap         = 0
      + tags         = (known after apply)
      + target_node  = "milky-carina"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 2004

      + network {
          + bridge   = "evnet1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.0.0.51/24"
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be created
  + resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      + arch         = "amd64"
      + clone        = "9102"
      + cmode        = "tty"
      + console      = true
      + cores        = 1
      + cpulimit     = 0
      + cpuunits     = 1024
      + description  = "cloudflare tunnel for Solufit"
      + hostname     = "solufit-cloudflare-tunnel-3"
      + id           = (known after apply)
      + memory       = 256
      + onboot       = true
      + ostype       = (known after apply)
      + pool         = "solufit"
      + protection   = false
      + start        = true
      + swap         = 0
      + tags         = (known after apply)
      + target_node  = "milky-polaris"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 2005

      + network {
          + bridge   = "evnet1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.0.0.52/24"
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-4 will be created
  + resource "proxmox_lxc" "cloudflare-tunnel-solufit-4" {
      + arch         = "amd64"
      + clone        = "9101"
      + cmode        = "tty"
      + console      = true
      + cores        = 1
      + cpulimit     = 0
      + cpuunits     = 1024
      + description  = "cloudflare tunnel for Solufit"
      + hostname     = "solufit-cloudflare-tunnel-4"
      + id           = (known after apply)
      + memory       = 256
      + onboot       = true
      + ostype       = (known after apply)
      + pool         = "solufit"
      + protection   = false
      + start        = true
      + swap         = 0
      + tags         = (known after apply)
      + target_node  = "milky-carina"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 2005

      + network {
          + bridge   = "evnet1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "10.0.0.53/24"
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr2"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "dhcp"
          + mtu      = 1400
          + name     = "eth1"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "172.16.0.69"
          + name     = "eth2"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "172.16.1.66/26"
          + name     = "eth3"
          + tag      = 4
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "172.16.0.134/26"
          + name     = "eth4"
          + tag      = 20
          + trunks   = (known after apply)
          + type     = (known after apply)
        }
      + network {
          + bridge   = "vmbr1"
          + firewall = false
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "172.16.0.198/26"
          + name     = "eth5"
          + tag      = 21
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be destroyed
  # (because proxmox_vm_qemu.cloudflare-tunnel-solufit-2 is not in configuration)
  - resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 3 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.0.0.51" -> null
      - define_connection_info = true -> null
      - desc                   = "cloudflare tunnel for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-polaris/qemu/2004" -> null
      - ipconfig0              = "ip=10.0.0.51/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "solufit-cloudflare-tunnel-2" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.0.0.51" -> null
      - ssh_host               = "10.0.0.51" -> null
      - ssh_port               = "22" -> null
      - ssh_private_key        = (sensitive value) -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-polaris" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 2004 -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "10G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "evnet1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "76:35:5A:B8:FB:94" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "46:6F:19:EA:D3:5B" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "1e0f7626-da6a-4427-ab5a-59b6b291964e" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be destroyed
  # (because proxmox_vm_qemu.cloudflare-tunnel-solufit-3 is not in configuration)
  - resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0;ide0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 3 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.0.0.52" -> null
      - define_connection_info = true -> null
      - desc                   = "cloudflare tunnel for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-carina/qemu/2005" -> null
      - ipconfig0              = "ip=10.0.0.52/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "solufit-cloudflare-tunnel-3" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.0.0.52" -> null
      - ssh_host               = "10.0.0.52" -> null
      - ssh_port               = "22" -> null
      - ssh_private_key        = (sensitive value) -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-carina" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 2005 -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "10G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "evnet1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "AE:F4:D9:FF:2B:C9" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "7E:4E:94:2C:64:20" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "dbc77b2c-e8d2-4bb1-b8ed-5f289a20fe15" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be destroyed
  # (because proxmox_vm_qemu.cloudflare-tunnel-solufit-4 is not in configuration)
  - resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 3 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.0.0.53" -> null
      - define_connection_info = true -> null
      - desc                   = "cloudflare tunnel for Solufit" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-carina/qemu/2006" -> null
      - ipconfig0              = "ip=10.0.0.53/24" -> null
      - ipconfig1              = "ip=172.16.0.69/26" -> null
      - ipconfig2              = "ip=dhcp" -> null
      - ipconfig3              = "ip=172.16.1.66/26" -> null
      - ipconfig4              = "ip=172.16.0.134/26" -> null
      - ipconfig5              = "ip=172.16.0.198/26" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 4096 -> null
      - name                   = "solufit-cloudflare-tunnel-4" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.0.0.53" -> null
      - ssh_host               = "10.0.0.53" -> null
      - ssh_port               = "22" -> null
      - ssh_private_key        = (sensitive value) -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-carina" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
      - vmid                   = 2006 -> null
        # (21 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "10G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "evnet1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "8E:6D:A1:A2:09:AA" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "5A:C3:F4:54:78:85" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "FA:5B:DF:1A:49:07" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "A2:FB:D5:49:B5:01" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 4 -> null
        }
      - network {
          - bridge    = "vmbr1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "4A:84:E4:3D:84:B5" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 20 -> null
        }
      - network {
          - bridge    = "vmbr1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "D6:BD:B7:0D:FC:07" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 21 -> null
        }

      - smbios {
          - uuid         = "0af0f56d-654e-48b1-83e0-34301e51a1d8" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/10000"
        name                   = "solufit-k3s-controller-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/11000"
        name                   = "solufit-k3s-worker-1"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 8 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*